function f=myfun(z)
 %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 自定义函数，用于数值求逆。本程序定义的是 瑞利衰落信道、 有界路损模型下的干扰CDF的
% 拉普拉斯变换：L_I(z)/z。其中数值期望用自定义的NumExpect()函数计算。
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 作者：夏洪星
% 日期：2015-09-23
% 于西安电子科技大学主楼2-260
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
 p = 1;
 lambda = 1;
 cd = pi;
 a = p*lambda*cd;
 SqPi = sqrt(pi);
 f = exp(a*(-pi*sqrt(z)/2+SqPi*NumExpect(z)))/z;   % 数值求均值后计算第二部分的值。
 %f = exp(a*(-pi*sqrt(z)/2))/z;                      %定义无界路损模型下的函数。  
 %f = exp(a*(z/(z+1)-pi*sqrt(z)/2+sqrt(pi*z)*Faddeeva_erfc(sqrt(z))))/z;  % 定义确定信道下的函数。

end