function ne = NumExpect(z)
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 用于非奇异路损模型泊松网络的干扰分析I(z)，其拉普拉斯变换为
% L_I(z) = exp(a*(-pi*sqrt(s)/2+sqrt(pi)*Expectaion(sqrt(z*h)*erfc(sqrt(z*h)))))
% 本程序用于计算 期望部分的值：Expectation(sqrt(z*h)*erfc(sqrt(z*h)));
% 对于瑞利衰落信道而言(均值为1)，密度为exp(-h)，所以期望的计算公式为：
% sum(sqrt(z*h)*erfc(sqrt(z*h))*exp(-h),[0,inf])
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 作者：夏洪星
% 日期：2015-09-23
% 于西安电子科技大学主楼2-260
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

ff1 = @(x) sqrt(z.*x).*(1-Faddeeva_erf(sqrt(z.*x))).*exp(-x);
ff2 = chebfun(ff1,[0,inf],'splitting','on');  %利用chebfun工具箱进行数值积分，Faddeeva_erf()可以以向量作为输入参数。
ne = sum(ff2);

